### Standard Kegs
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'
#tap 'homebrew/fuse'


### Updated versions of OS software 
#tap 'homebrew/dupes'

### Custom Kegs
tap 'ravenac95/sudolikeaboss'
brew 'sudolikeaboss'

tap 'neovim/neovim'
brew 'neovim'

# Or use docker run -v $(pwd):/data --workdir=/data -t wata727/tflint
#tap 'wata727/tflint'
#brew 'tflint'

### Version managers
brew 'tfenv'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'ruby-build'

### Native Applications
cask 'alfred'
cask 'dash'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'hazel'
cask 'istat-menus'
cask 'keybase'
#cask 'textexpander'
cask 'google-chrome'
cask 'macdown'
cask 'nvalt'
cask 'royal-tsx'
cask 'skitch'
cask 'spideroakone'
cask 'vagrant'
cask 'vlc'

### Brews ###

### Better copy/paste with tmux 
brew 'reattach-to-user-namespace', args: ['with-wrap-pbcopy-and-pbpaste']
brew 'tmux'

### Essential build tools
brew 'autoconf'
brew 'automake'

# AWS Support
brew 'awscli'
brew 'aws-shell'
brew 'awslogs'

# Heroku Support
brew 'heroku'
brew 'heroku-toolbelt'

# Shells
brew 'fish'
#brew 'bash'

# Github support
brew 'hub'
#brew 'git'

# Development tools
brew 'dnsmasq'

# Encryption
brew 'gnupg'
brew 'gpg-agent'
brew 'gpgme'

# Security
brew 'sleuthkit'
brew 'yara'

# Hashicorp
brew 'packer'
# brew 'terragrunt'

# Search tools
brew 'findutils'
#brew 'ack'
#brew 'ripgrep'
brew 'the_silver_searcher'
#brew 'osquery'

# Collaboration
brew 'tmate'

# Utilities
brew 'htop'
brew 'jq'
brew 'mtr'
brew 'multitail'
brew 'p7zip'
brew 'pv'
brew 'pwgen'
brew 'slackcat'
brew 'socat'
brew 'spark'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'xz'
brew 'the_silver_searcher'
brew 'msmtp'
brew 'mutt', args: ['with-gpgme', 'with-s-lang']
brew 'offlineimap', restart_service: true
brew 'notmuch'
#brew 'vcsh'

#brew 'https://raw.github.com/tgray/homebrew-tgbrew/master/muttqt.rb'

# Dependencies
brew 'readline'
